/* 1. функція для підрахунку суми масиву
2.Знайти базовий випадок перевірка чи масив порожній
3.Якщо базовий випадок порожній повертаємо 0 інакше рекурсивний випадок
4.Зберігаємо перше число у змінну (наприклад, first_num)
5.Видаляємо це перше число з масиву 
6.Повертаємо наше збережене перше число + результат функції sum() для залишку масиву */

#include <iostream> // бібліотеки
#include <vector>

using namespace std; //скорочення

int sum(vector<int> arr) // вектор і пустий масив(парамитр)(arr)
{
if (arr.empty()) //функція(якщо масив пустий, повертаємо 0(return 0, базовий випадок для рекурсії, щоб вона не робилась вічно))
{ 
return 0;
} else { //рекурсія
    int first_num = arr[0]; //перше число індекс 0

    arr.erase(arr.begin()); //видаляємо перше число в списку(erase-стерти,begin - перше)

    return first_num + sum(arr); //повертаємо перше число + інші числа
  }
}
int main() //двигун
{
    vector<int> my_arr = {2, 4, 6}; //список цифа

    cout << "Finally sum: " << sum(my_arr) << endl; //виведення суми в термінал

    return 0; //кінець програми

    //Вправа 4.1


}