/*1.Рекурсивна функція для підрахунку елементів
2.Базовий випадок: перевіряємо, чи масив порожній (arr.empty()), якщо так повертаємо 0;
3.Рекурсивний випадок (якщо масив не порожній):
4.Видаляємо перший елемент з масиву (arr.erase)
5.Повертаємо цифру 1 ПЛЮС результат функції count_elements() для залишку масиву*/
#include <iostream>
#include <vector> //бібліотеки

using namespace std; // скорочення

int count_elements (vector<int> arr) //вектор + масив(arr)
{
    if (arr.empty()) //функція, якщо масив пустий поверни 0(базовий випадок)
    {
        return 0; //повернення
    } else { //рекурсія
        arr.erase(arr.begin()); //видалення першого елементу з масиву

        return 1 + count_elements(arr); //повернення 1 + елементів масиву для підрахування елементів масиву

    }
}
int main() // двигун
{
    vector<int> my_arr {6, 5, 33, 14, 6}; // заповнений масив 

    cout << "How much elements in list: " << count_elements(my_arr) << endl; //виведення 

    return 0; //закінчення програми!
}
//4.2